Autodesk.Navisworks.Api.ClipPlane
A representation of a clipping plane.

Autodesk.Navisworks.Api.ClipPlane.#ctor


Autodesk.Navisworks.Api.ClipPlane.#ctor(Autodesk.Navisworks.Api.ClipPlane)
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Alignment
The clip plane alignment.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlane.AlignToOrientation(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'up' is null
Throws System.ArgumentException:
Argument 'up' has been Disposed
Throws System.ArgumentNullException:
Argument 'front' is null
Throws System.ArgumentException:
Argument 'front' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.AlignToPick(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.AlignToPick(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed
Throws System.ArgumentException:
Argument 'xAxis' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.ApplyTransform(Autodesk.Navisworks.Api.Transform3D)
Transforms the clip plane.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'trans' is null
Throws System.ArgumentException:
Argument 'trans' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.CopyFrom(Autodesk.Navisworks.Api.ClipPlane)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Default
Is this clip plane in the default (uninitialized) state.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Distance
The distance of the plane from the world origin.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Enabled
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlane.Initialize(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentException:
Argument 'up' has been Disposed
Throws System.ArgumentException:
Argument 'front' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Initialize(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentException:
Argument 'up' has been Disposed
Throws System.ArgumentException:
Argument 'front' has been Disposed
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Initialize(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentException:
Argument 'up' has been Disposed
Throws System.ArgumentException:
Argument 'front' has been Disposed
Throws System.ArgumentException:
Argument 'normal' has been Disposed
Throws System.ArgumentException:
Argument 'xAxis' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Initialize(Autodesk.Navisworks.Api.ClipPlaneAlignment,Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.ClipPlane.Move(System.Double)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlane.Normal
The normal of the plane.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Origin
The origin of the plane.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Reset
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlane.State
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlane.Transform
The transform of this plane.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'trans' is null
Throws System.ArgumentException:
Argument 'trans' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.Translate(Autodesk.Navisworks.Api.Vector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'offset' is null
Throws System.ArgumentException:
Argument 'offset' has been Disposed

Autodesk.Navisworks.Api.ClipPlane.XAxis
Returns the X axis for the clip plane.
Throws System.ObjectDisposedException:
Object has been Disposed